[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria or Mother-in-Law’s Tongue, is one of the most resilient indoor plants you can own. Its upright sword-like leaves add a bold architectural touch to any space. This plant is renowned for filtering indoor air toxins such as formaldehyde and benzene, making it a favorite for bedrooms and offices. It thrives in low light and needs only occasional watering, perfect for forgetful plant parents.",
    "image": "https://images.pexels.com/photos/2123482/pexels-photo-2123482.jpeg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Peace Lily",
    "category": "Flowering",
    "price": 22,
    "rating": 4.7,
    "availableStock": 12,
    "careLevel": "Medium",
    "description": "The Peace Lily brings a calm elegance to your home with its glossy, deep-green foliage and signature white blooms that resemble delicate sails. It’s not just beautiful — it’s an excellent natural air purifier, removing mold spores and household toxins. Peace Lilies prefer shaded corners with moist soil and reward you with year-round flowering. Ideal for those seeking serenity and purity in their space.",
    "image": "https://www.mydomaine.com/thmb/4UnbSzKiz0ZbB5vF7LX5XNum7PI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/1566417254329_20190821-1566417255317-b9314f1d9f7a4668a466c5ffb1913a8f.jpg",
    "providerName": "Leaf & Bloom"
  },
  {
    "plantId": 3,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 15,
    "rating": 4.6,
    "availableStock": 20,
    "careLevel": "Easy",
    "description": "A timeless favorite, the Spider Plant is known for its cascading green and white leaves that gracefully arch from the pot. This hardy species thrives in most indoor conditions and even produces 'pups' — baby plants that can be replanted easily. It's one of NASA’s top-rated air purifiers, helping remove formaldehyde and carbon monoxide from your environment. Perfect for hanging baskets or tabletops that need a touch of fresh life.",
    "image": "https://cdn.shopify.com/s/files/1/0621/8157/2697/files/b8wpzfbwjghky6fuaarq.jpg?v=1738155626",
    "providerName": "GreenHaven BD"
  },
  {
    "plantId": 4,
    "plantName": "Aloe Vera",
    "category": "Succulent",
    "price": 14,
    "rating": 4.9,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera isn’t just a plant — it’s a home remedy powerhouse. Known for its thick, gel-filled leaves used to soothe burns and skin irritations, this succulent thrives in bright, sunny locations. It requires minimal watering, making it ideal for busy plant owners. Its clean, geometric form also brings a natural minimalist beauty to desks and windowsills.",
    "image": "https://images.pexels.com/photos/3234638/pexels-photo-3234638.jpeg",
    "providerName": "HealingRoots"
  },
  {
    "plantId": 5,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 28,
    "rating": 4.8,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The ZZ Plant is practically indestructible, making it a must-have for beginners or low-maintenance lovers. Its waxy, dark-green leaves reflect light beautifully, instantly brightening a dull room. This plant tolerates neglect, low light, and infrequent watering — yet continues to thrive. Symbolically, it’s said to bring prosperity and positive energy to the home.",
    "image": "https://myjungleclub.com/cdn/shop/files/Plants-265_zz.webp?v=1711733426&width=1100",
    "providerName": "Botanica Home"
  },
  {
    "plantId": 6,
    "plantName": "Pothos Golden",
    "category": "Trailing",
    "price": 17,
    "rating": 4.5,
    "availableStock": 18,
    "careLevel": "Easy",
    "description": "The Golden Pothos, often called Devil’s Ivy, is a vibrant trailing vine with heart-shaped golden-green leaves that seem to glow in soft light. It’s a fast grower that adapts to almost any indoor environment, whether in a hanging pot or climbing along a trellis. This plant naturally filters the air while bringing a warm, tropical touch to your room. Easy to care for and impossible not to love.",
    "image": "https://cdn.thestem.co.uk/production/imager-transforms/digitaloceanspaces/product-images/plants/golden-pothos/373376/resize_Golden-Pothos-Group-1-0310_46b8f3075629629ddc66a01cf289b97e.webp",
    "providerName": "NatureNest"
  },
  {
    "plantId": 7,
    "plantName": "Monstera Deliciosa",
    "category": "Decorative",
    "price": 45,
    "rating": 4.9,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "The Monstera Deliciosa, affectionately known as the 'Swiss Cheese Plant,' is a design icon with its large, split leaves. It brings a dramatic tropical look to interiors, symbolizing abundance and growth. As it matures, its leaves develop deep fenestrations that make it visually stunning. Given moderate light and humidity, this plant quickly becomes the centerpiece of any room.",
    "image": "https://www.palmnursery.com.au/assets/full/MONDEL13.jpg?20200707031106",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 8,
    "plantName": "Rubber Plant",
    "category": "Foliage",
    "price": 30,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Medium",
    "description": "With its bold, glossy leaves and upright structure, the Rubber Plant adds a sleek, modern aesthetic to living rooms and workspaces. It thrives in bright, indirect sunlight and helps purify indoor air effectively. Its deep green foliage can grow into a full indoor tree if properly cared for. A strong visual statement that embodies both style and simplicity.",
    "image": "https://www.plantsforallseasons.co.uk/cdn/shop/files/25_-_45cm_Ficus_Robusta_Rubber_Plant_12cm_Pot_House_Plant.webp?v=1760043453",
    "providerName": "Leaf & Bloom"
  },
  {
    "plantId": 9,
    "plantName": "Areca Palm",
    "category": "Air Purifier",
    "price": 35,
    "rating": 4.7,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Areca Palm is a graceful indoor palm with feathery fronds that instantly create a lush, tropical atmosphere. Known for its strong air-purifying abilities, it can reduce indoor pollutants while increasing humidity. It’s pet-friendly, making it a great addition to homes with cats or dogs. Ideal for large spaces that need a soft, breezy touch of green.",
    "image": "https://thebanyantree.com.au/cdn/shop/products/32.412.12_1800x1800.jpg?v=1585195755",
    "providerName": "GreenHaven BD"
  },
  {
    "plantId": 10,
    "plantName": "Money Plant Marble Queen",
    "category": "Trailing",
    "price": 16,
    "rating": 4.5,
    "availableStock": 22,
    "careLevel": "Easy",
    "description": "The Marble Queen variety of the Money Plant boasts creamy white marbled patterns on lush green leaves, adding an elegant contrast to any corner. Believed to bring luck and wealth, this trailing vine thrives in both soil and water. Its resilience makes it a favorite for new plant owners. Hang it high or let it climb — it always looks royal and full of life.",
    "image": "https://finecity.ae/cdn/shop/products/92.Epipremnumpinnatum_MarbleQueen_2049x2049.jpg?v=1629292015",
    "providerName": "HealingRoots"
  },
  {
    "plantId": 11,
    "plantName": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 50,
    "rating": 4.6,
    "availableStock": 4,
    "careLevel": "Hard",
    "description": "The Fiddle Leaf Fig is a striking indoor tree loved for its large, glossy leaves shaped like violins. It thrives in bright, indirect sunlight and instantly elevates modern interiors. Though slightly fussy about watering and light, its dramatic silhouette is worth the effort. A true statement piece for those who want their home to feel alive and artful.",
    "image": "https://cdn.thestem.co.uk/production/imager-transforms/digitaloceanspaces/product-images/plants/fiddle-leaf-fig-tree/134066/fiddle-leaf-fig-tree_46b8f3075629629ddc66a01cf289b97e.webp",
    "providerName": "Botanica Home"
  },
  {
    "plantId": 12,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 20,
    "rating": 4.8,
    "availableStock": 13,
    "careLevel": "Easy",
    "description": "Known as the 'money tree' in Feng Shui, the Jade Plant features plump, shiny leaves that symbolize prosperity and resilience. This succulent thrives in sunlight and needs very little water, making it an easy companion for windowsills. Its thick stems grow tree-like over time, giving it a timeless charm. A classic good-luck plant that brings balance and serenity to your home.",
    "image": "https://www.shelmerdine.com/wp-content/uploads/2020/06/Jade-Plant-scaled-e1725130200367.jpg",
    "providerName": "NatureNest"
  },
  {
    "plantId": 13,
    "plantName": "Boston Fern",
    "category": "Air Purifier",
    "price": 25,
    "rating": 4.4,
    "availableStock": 14,
    "careLevel": "Medium",
    "description": "The Boston Fern’s lush, arching fronds create a classic and refreshing green display in any indoor setting. It thrives in humid environments, making it ideal for bathrooms or shaded corners. Beyond beauty, it also removes toxins like formaldehyde from the air. Keep its soil moist and it will reward you with full, cascading greenery all year long.",
    "image": "https://www.houseofkojo.com/cdn/shop/products/boston-fern-or-nephrolepis-exaltata-green-lady-boston-fern-or-nephrolepis-exaltata-green-lady--1_1800x1800.jpg?v=1704024111",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 14,
    "plantName": "Lucky Bamboo",
    "category": "Symbolic",
    "price": 19,
    "rating": 4.3,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "Lucky Bamboo is a timeless symbol of wealth, happiness, and vitality. Its elegant green stalks grow beautifully in both water and soil, needing minimal care. It’s often gifted for new beginnings and good fortune, especially in Asian households. Place it on your desk or near a window for a continuous reminder of peace and prosperity.",
    "image": "https://i5.walmartimages.com/seo/Costa-Farms-14-Tall-Lucky-Bamboo-Low-Indirect-Sunlight-Indoor-Live-House-Plants_15983924-2b1e-4678-8619-f7c7e10e77df.89be95a4ebe7cd4be67c810775b2a23e.jpeg?odnHeight=2000&odnWidth=2000&odnBg=FFFFFF",
    "providerName": "Leaf & Bloom"
  },
  {
    "plantId": 15,
    "plantName": "Calathea Orbifolia",
    "category": "Decorative",
    "price": 38,
    "rating": 4.6,
    "availableStock": 8,
    "careLevel": "Hard",
    "description": "The Calathea Orbifolia is pure art in plant form — its broad, silver-striped leaves look hand-painted. Native to tropical forests, it thrives in high humidity and indirect light. This plant folds its leaves at night, a mesmerizing natural behavior known as 'prayer motion.' While a bit finicky, its stunning texture and pattern make the extra care worthwhile.",
    "image": "https://hortology.co.uk/cdn/shop/files/Calathea-orbifolia-12x35cm-Noor-Plant-Pot-Velvet-Green-16x13cm_5000x.jpg?v=1689774697",
    "providerName": "GreenHaven BD"
  },
  {
    "plantId": 16,
    "plantName": "Chinese Evergreen",
    "category": "Low Light",
    "price": 21,
    "rating": 4.7,
    "availableStock": 19,
    "careLevel": "Easy",
    "description": "The Chinese Evergreen is a colorful, resilient houseplant ideal for low-light areas. Its leaves feature soft shades of green, silver, or even pink, giving a cheerful vibe to dim corners. It’s forgiving to occasional neglect and helps purify indoor air. A versatile beauty that combines hardiness with tropical flair.",
    "image": "https://asset.bloomnation.com/c_pad,d_vendor:global:catalog:product:image.png,f_auto,fl_preserve_transparency,q_auto,w_1200/v1752305928/vendor/6687/catalog/product/2/0/20210824100542_file_61256d3608218_61256d88b5299._649b038eeb494.jpg",
    "providerName": "HealingRoots"
  },
  {
    "plantId": 17,
    "plantName": "Philodendron Birkin",
    "category": "Decorative",
    "price": 33,
    "rating": 4.8,
    "availableStock": 9,
    "careLevel": "Medium",
    "description": "Philodendron Birkin stands out with its dark, glossy leaves streaked by elegant white pinstripes. Over time, it develops a unique leaf pattern on every new growth. It prefers indirect sunlight and consistent moisture but forgives mild neglect. A sophisticated, compact plant for anyone who appreciates subtle elegance.",
    "image": "https://www.myjunglehome.com.au/cdn/shop/products/philodendron-birkin-13cm-pot-my-jungle-home-758279_540x.jpg?v=1671202719",
    "providerName": "Botanica Home"
  },
  {
    "plantId": 18,
    "plantName": "Anthurium Red",
    "category": "Flowering",
    "price": 40,
    "rating": 4.9,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "Anthurium Red is the definition of bold elegance with its waxy, heart-shaped flowers that bloom in vibrant red throughout the year. It symbolizes love, hospitality, and abundance. Beyond its ornamental charm, it purifies indoor air and thrives in moderate humidity. A living gift of beauty that never goes unnoticed.",
    "image": "https://www.theplantcompany.co.nz/file/getimage/shop/jpg/lg/anthurium-red.webp",
    "providerName": "NatureNest"
  },
  {
    "plantId": 19,
    "plantName": "Dracaena Marginata",
    "category": "Air Purifier",
    "price": 27,
    "rating": 4.5,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "Also known as the Dragon Tree, Dracaena Marginata features long, slender leaves edged in red for a striking contrast. It’s a perfect fit for minimalist or modern interiors. This hardy species filters out toxins and thrives on minimal attention. Its sculptural form adds both structure and warmth to any room.",
    "image": "https://florastore.com/cdn/shop/files/2073241_Productimage_02_SQ_a4ecad16-1482-4246-9455-3147b054d0c9.png?v=1755336139&width=720",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 20,
    "plantName": "Parlor Palm",
    "category": "Low Light",
    "price": 26,
    "rating": 4.6,
    "availableStock": 16,
    "careLevel": "Easy",
    "description": "The Parlor Palm is an indoor classic that brings an effortless tropical charm to compact spaces. Its delicate fronds grow gracefully even under low light, making it perfect for apartments or offices. Easygoing and pet-safe, it also improves indoor air quality. A soft, elegant presence that quietly enhances your environment.",
    "image": "https://d3gkbidvk2xej.cloudfront.net/images/products/9597aeb6-a7d1-48bf-a5f2-ba567c3c7bff/s/parlor-palm-olive-scandinavian-ceramic.jpeg?version=1745276626.68290019800&fm=webp&w=449&h=598&fit=crop",
    "providerName": "Leaf & Bloom"
  },
  {
    "plantId": 21,
    "plantName": "Dieffenbachia Camille",
    "category": "Foliage",
    "price": 24,
    "rating": 4.4,
    "availableStock": 10,
    "careLevel": "Medium",
    "description": "Dieffenbachia Camille features lush leaves with creamy white centers framed by deep green borders, giving it a painterly look. It thrives in bright, indirect light and brings a touch of tropical luxury indoors. With regular watering and humidity, it grows into a full, bushy houseplant. A natural statement of calm and sophistication.",
    "image": "https://img.crocdn.co.uk/images/products2/pl/20/00/04/40/pl2000044097_card3_lg.jpg",
    "providerName": "GreenHaven BD"
  },
  {
    "plantId": 22,
    "plantName": "Aglaonema Red Siam",
    "category": "Decorative",
    "price": 29,
    "rating": 4.7,
    "availableStock": 8,
    "careLevel": "Medium",
    "description": "The Aglaonema Red Siam dazzles with its bright, rosy leaves veined with green — a splash of living color for any room. It’s surprisingly low-maintenance for such a vibrant plant, thriving even under fluorescent light. Associated with positive energy and prosperity, it’s a favorite for both homes and offices. A true tropical jewel that asks little but gives much.",
    "image": "https://wildwillysplantsandflowers.ca/cdn/shop/products/AglaonemaRedSiam.webp?v=1675452909",
    "providerName": "HealingRoots"
  },
  {
    "plantId": 23,
    "plantName": "Haworthia Fasciata",
    "category": "Succulent",
    "price": 12,
    "rating": 4.8,
    "availableStock": 25,
    "careLevel": "Easy",
    "description": "Haworthia Fasciata, or the Zebra Succulent, is a compact and charming desert plant with striped, spiky leaves that look sculptural. It’s ideal for small spaces, desks, or shelves and requires almost no attention. This hardy little succulent thrives in bright, indirect light with occasional watering. A miniature masterpiece that brings calm and order to any workspace.",
    "image": "https://littleprinceplants.com/wp-content/uploads/2024/08/Haworthia-fasciata-var.-concolor-12.2018.2-scaled.jpg.webp",
    "providerName": "Botanica Home"
  },
  {
    "plantId": 24,
    "plantName": "Oxalis Triangularis",
    "category": "Decorative",
    "price": 23,
    "rating": 4.5,
    "availableStock": 13,
    "careLevel": "Medium",
    "description": "Known as the Purple Shamrock, the Oxalis Triangularis boasts deep violet, butterfly-shaped leaves that fold closed at night. It produces delicate pink or white blooms that contrast beautifully with its foliage. This magical, light-sensitive plant thrives in moderate light and cool temperatures. A living piece of poetry that transforms with the rhythm of day and night.",
    "image": "https://www.bumbleplants.com/cdn/shop/products/OxalisTriangularisPurpleFalseShamrock_8.jpg?v=1740372155&width=1200",
    "providerName": "NatureNest"
  },
  {
    "plantId": 25,
    "plantName": "Bamboo Palm",
    "category": "Air Purifier",
    "price": 36,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Medium",
    "description": "The Bamboo Palm, or Chamaedorea seifrizii, is a graceful air-purifying palm that instantly adds tropical sophistication to interiors. It grows tall with multiple thin stems and feathered fronds, creating a serene, natural backdrop. It prefers moderate light and steady moisture, thriving even in shaded rooms. An elegant reminder of nature’s calm rhythm, perfect for both homes and offices.",
    "image": "https://www.heyrooted.com/cdn/shop/files/PALM_BAMBOO_10-2.jpg?v=1722615419&width=1100",
    "providerName": "UrbanGreen Studio"
  }
]
